<template>
  <Navigation/>

  <header class="header">
    <img src="../assets/cutted_logo.png" alt="Resource logo" width="140">
    <h1>LearniKo</h1>
  </header>
  <div id="accordion-placeholder" class="accordion-container">
    <h3>Теми</h3>
  </div>
  <main class="content">
    <input type="text" id="theme-search" placeholder="🔍 Пошук теми за назвою...">
    <section id="themes_list">
      <article>
        <p>Не певен, яку мову обрати?<a href="feedback.html">Напиши нам</a> і ми допоможемо тобі визначитися.</p>
      </article>
      <article class="theme-item">
        <h3 id="python_theme">Python</h3>
        <p><img src="https://images.icon-icons.com/2699/PNG/512/python_logo_icon_168886.png" width="200" alt="Python"></p>
        <p><strong>Рівень:</strong> Початковий</p>
        <p><strong>Примітки:</strong> Популярна у Data Science, веб-розробці, автоматизації.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Синтаксис та базові конструкції:</strong> змінні, оператори, умови, цикли.</li>
          <li><strong>Функції та модулі:</strong> створення та використання функцій, підключення модулів, робота з файлами.</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Теоретичні завдання</li>
          <li>Практичні вправи</li>
          <li>Міні-проєкти</li>
        </ul>
      </article>
      <article class="theme-item">
        <h3 id="java_theme">Java</h3>
        <p><img src="https://cdn4.iconfinder.com/data/icons/logos-and-brands/512/181_Java_logo_logos-512.png" width="200" alt="Java"></p>
        <p><strong>Рівень:</strong> Середній</p>
        <p><strong>Примітки:</strong> Кросплатформенність через JVM, використовується у корпоративній розробці, Android-додатках.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Основи ООП:</strong> класи, об’єкти, наслідування, інкапсуляція, поліморфізм.</li>
          <li><strong>Колекції:</strong> ArrayList, HashMap, TreeSet, обробка даних у структурах.</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Практичні завдання</li>
          <li>Проєктні завдання</li>
        </ul>
      </article>
      <article class="theme-item">
        <h3 id="js_theme">JavaScript</h3>
        <p><img src="https://static.vecteezy.com/system/resources/previews/027/127/463/non_2x/javascript-logo-javascript-icon-transparent-free-png.png" width="200" alt="JavaScript"></p>
        <p><strong>Рівень:</strong> Початковий</p>
        <p><strong>Примітки:</strong> Використовується для фронтенд-розробки, створення інтерактивних веб-сторінок.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Веб-розробка:</strong> HTML, CSS, інтеграція JS</li>
          <li><strong>DOM та події:</strong> маніпуляції елементами сторінки, обробка кліків і подій</li>
          <li><strong>Динамічні сторінки:</strong> робота з API, асинхронні запити</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Практичні інтерактивні вправи</li>
          <li>Міні-проєкти</li>
        </ul>
      </article>
      <article class="theme-item">
        <h3 id="c++_theme">C++</h3>
        <p><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/1/18/ISO_C%2B%2B_Logo.svg/1822px-ISO_C%2B%2B_Logo.svg.png" width="200" alt="C++"></p>
        <p><strong>Рівень:</strong> Поглиблений</p>
        <p><strong>Примітки:</strong> Використовується для системного програмування, ігор, високопродуктивних додатків.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Системне програмування:</strong> управління пам’яттю, указівники, робота з файлами.</li>
          <li><strong>STL:</strong> вектори, списки, множини, алгоритми STL.</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Алгоритмічні задачі</li>
          <li>Практичні завдання високої складності</li>
        </ul>
      </article>
      <article class="theme-item">
        <h3 id="ruby_theme">Ruby</h3>
        <p><img src="https://upload.wikimedia.org/wikipedia/commons/f/f1/Ruby_logo.png" width="200" alt="Ruby"></p>
        <p><strong>Рівень:</strong> Початковий</p>
        <p><strong>Примітки:</strong> Популярна для веб-розробки (Rails), автоматизації, прототипування.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Основи мови:</strong> синтаксис, змінні, методи</li>
          <li><strong>Об’єктно-орієнтоване програмування:</strong> класи, об’єкти, модулі</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Практичні вправи</li>
          <li>Міні-проєкти</li>
        </ul>
      </article>
      <article class="theme-item">
        <h3 id="php_theme">PHP</h3>
        <p><img src="https://upload.wikimedia.org/wikipedia/commons/thumb/2/27/PHP-logo.svg/2560px-PHP-logo.svg.png" width="200" alt="PHP"></p>
        <p><strong>Рівень:</strong> Початковий</p>
        <p><strong>Примітки:</strong> Використовується для створення динамічних веб-сайтів та серверних скриптів.</p>
        <h4>Уроки:</h4>
        <ul>
          <li><strong>Основи PHP:</strong> синтаксис, змінні, оператори, функції</li>
          <li><strong>Взаємодія з базами даних:</strong> MySQL, CRUD-операції</li>
        </ul>
        <h4>Типи завдань:</h4>
        <ul>
          <li>Практичні вправи</li>
          <li>Міні-проєкти</li>
        </ul>
      </article>
      <article>
        <p>
          Визначився із мовою?.<a href="feedback.html">Напиши нам</a> і ми якнайскорше підберемо найзручніший тобі графік.
        </p>
      </article>
    </section>
  </main>
  <footer class="footer">
    <address>
      <p>Адреса: вул. Прикладна, 12, Київ, Україна</p>
      <p>Телефон: +380 50 123 45 67</p>
      <p>Пошта: desandali@gmail.com</p>
    </address>
    <p align="center">© 2025 LearniKo</p>
  </footer>
</template>
<style scoped src="../assets/themes_style.css"></style>
<script setup lang="ts">
import Navigation from "../components/Navigation.vue";
</script>